glow_getter_app/app/controllers/users_controller.rb

UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "swr228"], ["updated_at", "2020-03-06 18:17:46.601518"], ["id", 1]]
---
  def update
    if @user.update(user_params)

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def cartadd
    puts params
    @product = Product.find(params[:product_id])

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def cartremove
    @product = Product.find(params[:product_id])